bench/results/before.txt
LedgerGuard - BASELINE (naive screening path)
================================================================
Captured      : 2026-08-01 00:57:17 -04:00
Target        : https://ledgerguard.duvalkwali.tech (live)
Backend commit: 5a6e15c  (bugfixes only - no optimization yet)
Container     : 0.75 CPU / 768 MB, Postgres + Redis + Caddy on one droplet
Path measured : rules re-read from Postgres per request; audit entry
                appended synchronously inside the request transaction
Ledger state  : reset, then seeded with 500 screened transactions
================================================================


         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 3m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-08-01T04:54:17Z" level=info msg="baseline: authenticated against https://ledgerguard.duvalkwali.tech" source=console

running (0m01.0s), 001/100 VUs, 4 complete and 0 interrupted iterations
default   [   0% ] 001/100 VUs  0m00.7s/3m00.0s

running (0m02.0s), 001/100 VUs, 10 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m01.7s/3m00.0s

running (0m03.0s), 001/100 VUs, 17 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m02.7s/3m00.0s

running (0m04.0s), 002/100 VUs, 25 complete and 0 interrupted iterations
default   [   2% ] 002/100 VUs  0m03.7s/3m00.0s

running (0m05.0s), 002/100 VUs, 38 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m04.7s/3m00.0s

running (0m06.0s), 002/100 VUs, 50 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m05.7s/3m00.0s

running (0m07.0s), 003/100 VUs, 62 complete and 0 interrupted iterations
default   [   4% ] 003/100 VUs  0m06.7s/3m00.0s

running (0m08.0s), 003/100 VUs, 82 complete and 0 interrupted iterations
default   [   4% ] 003/100 VUs  0m07.7s/3m00.0s

running (0m09.0s), 003/100 VUs, 103 complete and 0 interrupted iterations
default   [   5% ] 003/100 VUs  0m08.7s/3m00.0s

running (0m10.0s), 003/100 VUs, 121 complete and 0 interrupted iterations
default   [   5% ] 003/100 VUs  0m09.7s/3m00.0s

running (0m11.0s), 004/100 VUs, 141 complete and 0 interrupted iterations
default   [   6% ] 004/100 VUs  0m10.7s/3m00.0s

running (0m12.0s), 004/100 VUs, 165 complete and 0 interrupted iterations
default   [   7% ] 004/100 VUs  0m11.7s/3m00.0s

running (0m13.0s), 004/100 VUs, 189 complete and 0 interrupted iterations
default   [   7% ] 004/100 VUs  0m12.7s/3m00.0s

running (0m14.0s), 005/100 VUs, 216 complete and 0 interrupted iterations
default   [   8% ] 005/100 VUs  0m13.7s/3m00.0s

running (0m15.0s), 005/100 VUs, 249 complete and 0 interrupted iterations
default   [   8% ] 005/100 VUs  0m14.7s/3m00.0s

running (0m16.0s), 005/100 VUs, 282 complete and 0 interrupted iterations
default   [   9% ] 005/100 VUs  0m15.7s/3m00.0s

running (0m17.0s), 006/100 VUs, 313 complete and 0 interrupted iterations
default   [   9% ] 006/100 VUs  0m16.7s/3m00.0s

running (0m18.0s), 006/100 VUs, 351 complete and 0 interrupted iterations
default   [  10% ] 006/100 VUs  0m17.7s/3m00.0s

running (0m19.0s), 006/100 VUs, 390 complete and 0 interrupted iterations
default   [  10% ] 006/100 VUs  0m18.7s/3m00.0s

running (0m20.0s), 006/100 VUs, 430 complete and 0 interrupted iterations
default   [  11% ] 006/100 VUs  0m19.7s/3m00.0s

running (0m21.0s), 007/100 VUs, 473 complete and 0 interrupted iterations
default   [  12% ] 007/100 VUs  0m20.7s/3m00.0s

running (0m22.0s), 007/100 VUs, 515 complete and 0 interrupted iterations
default   [  12% ] 007/100 VUs  0m21.7s/3m00.0s

running (0m23.0s), 007/100 VUs, 560 complete and 0 interrupted iterations
default   [  13% ] 007/100 VUs  0m22.7s/3m00.0s

running (0m24.0s), 008/100 VUs, 604 complete and 0 interrupted iterations
default   [  13% ] 008/100 VUs  0m23.7s/3m00.0s

running (0m25.0s), 008/100 VUs, 649 complete and 0 interrupted iterations
default   [  14% ] 008/100 VUs  0m24.7s/3m00.0s

running (0m26.0s), 008/100 VUs, 698 complete and 0 interrupted iterations
default   [  14% ] 008/100 VUs  0m25.7s/3m00.0s

running (0m27.0s), 009/100 VUs, 747 complete and 0 interrupted iterations
default   [  15% ] 009/100 VUs  0m26.7s/3m00.0s

running (0m28.0s), 009/100 VUs, 802 complete and 0 interrupted iterations
default   [  15% ] 009/100 VUs  0m27.7s/3m00.0s

running (0m29.0s), 009/100 VUs, 858 complete and 0 interrupted iterations
default   [  16% ] 009/100 VUs  0m28.7s/3m00.0s

running (0m30.0s), 009/100 VUs, 916 complete and 0 interrupted iterations
default   [  17% ] 009/100 VUs  0m29.7s/3m00.0s

running (0m31.0s), 010/100 VUs, 967 complete and 0 interrupted iterations
default   [  17% ] 010/100 VUs  0m30.7s/3m00.0s

running (0m32.0s), 011/100 VUs, 1027 complete and 0 interrupted iterations
default   [  18% ] 011/100 VUs  0m31.7s/3m00.0s

running (0m33.0s), 011/100 VUs, 1092 complete and 0 interrupted iterations
default   [  18% ] 011/100 VUs  0m32.7s/3m00.0s

running (0m34.0s), 012/100 VUs, 1156 complete and 0 interrupted iterations
default   [  19% ] 012/100 VUs  0m33.7s/3m00.0s

running (0m35.0s), 013/100 VUs, 1221 complete and 0 interrupted iterations
default   [  19% ] 013/100 VUs  0m34.7s/3m00.0s

running (0m36.0s), 013/100 VUs, 1294 complete and 0 interrupted iterations
default   [  20% ] 013/100 VUs  0m35.7s/3m00.0s

running (0m37.0s), 014/100 VUs, 1360 complete and 0 interrupted iterations
default   [  20% ] 014/100 VUs  0m36.7s/3m00.0s

running (0m38.0s), 015/100 VUs, 1434 complete and 0 interrupted iterations
default   [  21% ] 015/100 VUs  0m37.7s/3m00.0s

running (0m39.0s), 015/100 VUs, 1509 complete and 0 interrupted iterations
default   [  22% ] 015/100 VUs  0m38.7s/3m00.0s

running (0m40.0s), 016/100 VUs, 1575 complete and 0 interrupted iterations
default   [  22% ] 016/100 VUs  0m39.7s/3m00.0s

running (0m41.0s), 017/100 VUs, 1664 complete and 0 interrupted iterations
default   [  23% ] 017/100 VUs  0m40.7s/3m00.0s

running (0m42.0s), 017/100 VUs, 1743 complete and 0 interrupted iterations
default   [  23% ] 017/100 VUs  0m41.7s/3m00.0s

running (0m43.0s), 018/100 VUs, 1829 complete and 0 interrupted iterations
default   [  24% ] 018/100 VUs  0m42.7s/3m00.0s

running (0m44.0s), 019/100 VUs, 1899 complete and 0 interrupted iterations
default   [  24% ] 019/100 VUs  0m43.7s/3m00.0s

running (0m45.0s), 019/100 VUs, 1973 complete and 0 interrupted iterations
default   [  25% ] 019/100 VUs  0m44.7s/3m00.0s

running (0m46.0s), 020/100 VUs, 2049 complete and 0 interrupted iterations
default   [  25% ] 020/100 VUs  0m45.7s/3m00.0s

running (0m47.0s), 021/100 VUs, 2137 complete and 0 interrupted iterations
default   [  26% ] 021/100 VUs  0m46.7s/3m00.0s

running (0m48.0s), 021/100 VUs, 2220 complete and 0 interrupted iterations
default   [  27% ] 021/100 VUs  0m47.7s/3m00.0s

running (0m49.0s), 022/100 VUs, 2306 complete and 0 interrupted iterations
default   [  27% ] 022/100 VUs  0m48.7s/3m00.0s

running (0m50.0s), 023/100 VUs, 2399 complete and 0 interrupted iterations
default   [  28% ] 023/100 VUs  0m49.7s/3m00.0s

running (0m51.0s), 023/100 VUs, 2494 complete and 0 interrupted iterations
default   [  28% ] 023/100 VUs  0m50.7s/3m00.0s

running (0m52.0s), 024/100 VUs, 2588 complete and 0 interrupted iterations
default   [  29% ] 024/100 VUs  0m51.7s/3m00.0s

running (0m53.0s), 025/100 VUs, 2683 complete and 0 interrupted iterations
default   [  29% ] 025/100 VUs  0m52.7s/3m00.0s

running (0m54.0s), 025/100 VUs, 2772 complete and 0 interrupted iterations
default   [  30% ] 025/100 VUs  0m53.7s/3m00.0s

running (0m55.0s), 026/100 VUs, 2847 complete and 0 interrupted iterations
default   [  30% ] 026/100 VUs  0m54.7s/3m00.0s

running (0m56.0s), 027/100 VUs, 2926 complete and 0 interrupted iterations
default   [  31% ] 027/100 VUs  0m55.7s/3m00.0s

running (0m57.0s), 027/100 VUs, 3034 complete and 0 interrupted iterations
default   [  32% ] 027/100 VUs  0m56.7s/3m00.0s

running (0m58.0s), 028/100 VUs, 3150 complete and 0 interrupted iterations
default   [  32% ] 028/100 VUs  0m57.7s/3m00.0s

running (0m59.0s), 029/100 VUs, 3249 complete and 0 interrupted iterations
default   [  33% ] 029/100 VUs  0m58.7s/3m00.0s

running (1m00.0s), 029/100 VUs, 3364 complete and 0 interrupted iterations
default   [  33% ] 029/100 VUs  0m59.7s/3m00.0s

running (1m01.0s), 030/100 VUs, 3491 complete and 0 interrupted iterations
default   [  34% ] 030/100 VUs  1m00.7s/3m00.0s

running (1m02.0s), 031/100 VUs, 3592 complete and 0 interrupted iterations
default   [  34% ] 031/100 VUs  1m01.7s/3m00.0s

running (1m03.0s), 031/100 VUs, 3682 complete and 0 interrupted iterations
default   [  35% ] 031/100 VUs  1m02.7s/3m00.0s

running (1m04.0s), 032/100 VUs, 3770 complete and 0 interrupted iterations
default   [  35% ] 032/100 VUs  1m03.7s/3m00.0s

running (1m05.0s), 033/100 VUs, 3855 complete and 0 interrupted iterations
default   [  36% ] 033/100 VUs  1m04.7s/3m00.0s

running (1m06.0s), 033/100 VUs, 3957 complete and 0 interrupted iterations
default   [  37% ] 033/100 VUs  1m05.7s/3m00.0s

running (1m07.0s), 034/100 VUs, 4058 complete and 0 interrupted iterations
default   [  37% ] 034/100 VUs  1m06.7s/3m00.0s

running (1m08.0s), 035/100 VUs, 4193 complete and 0 interrupted iterations
default   [  38% ] 035/100 VUs  1m07.7s/3m00.0s

running (1m09.0s), 035/100 VUs, 4325 complete and 0 interrupted iterations
default   [  38% ] 035/100 VUs  1m08.7s/3m00.0s

running (1m10.0s), 036/100 VUs, 4439 complete and 0 interrupted iterations
default   [  39% ] 036/100 VUs  1m09.7s/3m00.0s

running (1m11.0s), 037/100 VUs, 4574 complete and 0 interrupted iterations
default   [  39% ] 037/100 VUs  1m10.7s/3m00.0s

running (1m12.0s), 037/100 VUs, 4694 complete and 0 interrupted iterations
default   [  40% ] 037/100 VUs  1m11.7s/3m00.0s

running (1m13.0s), 038/100 VUs, 4818 complete and 0 interrupted iterations
default   [  40% ] 038/100 VUs  1m12.7s/3m00.0s

running (1m14.0s), 039/100 VUs, 4943 complete and 0 interrupted iterations
default   [  41% ] 039/100 VUs  1m13.7s/3m00.0s

running (1m15.0s), 039/100 VUs, 5076 complete and 0 interrupted iterations
default   [  42% ] 039/100 VUs  1m14.7s/3m00.0s

running (1m16.0s), 040/100 VUs, 5223 complete and 0 interrupted iterations
default   [  42% ] 040/100 VUs  1m15.7s/3m00.0s

running (1m17.0s), 041/100 VUs, 5379 complete and 0 interrupted iterations
default   [  43% ] 041/100 VUs  1m16.7s/3m00.0s

running (1m18.0s), 041/100 VUs, 5552 complete and 0 interrupted iterations
default   [  43% ] 041/100 VUs  1m17.7s/3m00.0s

running (1m19.0s), 042/100 VUs, 5703 complete and 0 interrupted iterations
default   [  44% ] 042/100 VUs  1m18.7s/3m00.0s

running (1m20.0s), 043/100 VUs, 5822 complete and 0 interrupted iterations
default   [  44% ] 043/100 VUs  1m19.7s/3m00.0s

running (1m21.0s), 043/100 VUs, 5970 complete and 0 interrupted iterations
default   [  45% ] 043/100 VUs  1m20.7s/3m00.0s

running (1m22.0s), 044/100 VUs, 6130 complete and 0 interrupted iterations
default   [  45% ] 044/100 VUs  1m21.7s/3m00.0s

running (1m23.0s), 045/100 VUs, 6283 complete and 0 interrupted iterations
default   [  46% ] 045/100 VUs  1m22.7s/3m00.0s

running (1m24.0s), 045/100 VUs, 6447 complete and 0 interrupted iterations
default   [  47% ] 045/100 VUs  1m23.7s/3m00.0s

running (1m25.0s), 046/100 VUs, 6589 complete and 0 interrupted iterations
default   [  47% ] 046/100 VUs  1m24.7s/3m00.0s

running (1m26.0s), 047/100 VUs, 6720 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  1m25.7s/3m00.0s

running (1m27.0s), 047/100 VUs, 6849 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  1m26.7s/3m00.0s

running (1m28.0s), 048/100 VUs, 6989 complete and 0 interrupted iterations
default   [  49% ] 048/100 VUs  1m27.7s/3m00.0s

running (1m29.0s), 049/100 VUs, 7121 complete and 0 interrupted iterations
default   [  49% ] 049/100 VUs  1m28.7s/3m00.0s

running (1m30.0s), 049/100 VUs, 7246 complete and 0 interrupted iterations
default   [  50% ] 049/100 VUs  1m29.7s/3m00.0s

running (1m31.0s), 050/100 VUs, 7384 complete and 0 interrupted iterations
default   [  50% ] 050/100 VUs  1m30.7s/3m00.0s

running (1m32.0s), 051/100 VUs, 7519 complete and 0 interrupted iterations
default   [  51% ] 051/100 VUs  1m31.7s/3m00.0s

running (1m33.0s), 052/100 VUs, 7640 complete and 0 interrupted iterations
default   [  52% ] 052/100 VUs  1m32.7s/3m00.0s

running (1m34.0s), 053/100 VUs, 7766 complete and 0 interrupted iterations
default   [  52% ] 053/100 VUs  1m33.7s/3m00.0s

running (1m35.0s), 053/100 VUs, 7914 complete and 0 interrupted iterations
default   [  53% ] 053/100 VUs  1m34.7s/3m00.0s

running (1m36.0s), 054/100 VUs, 8074 complete and 0 interrupted iterations
default   [  53% ] 054/100 VUs  1m35.7s/3m00.0s

running (1m37.0s), 055/100 VUs, 8253 complete and 0 interrupted iterations
default   [  54% ] 055/100 VUs  1m36.7s/3m00.0s

running (1m38.0s), 056/100 VUs, 8422 complete and 0 interrupted iterations
default   [  54% ] 056/100 VUs  1m37.7s/3m00.0s

running (1m39.0s), 057/100 VUs, 8579 complete and 0 interrupted iterations
default   [  55% ] 057/100 VUs  1m38.7s/3m00.0s

running (1m40.0s), 058/100 VUs, 8731 complete and 0 interrupted iterations
default   [  55% ] 058/100 VUs  1m39.7s/3m00.0s

running (1m41.0s), 058/100 VUs, 8894 complete and 0 interrupted iterations
default   [  56% ] 058/100 VUs  1m40.7s/3m00.0s

running (1m42.0s), 059/100 VUs, 9061 complete and 0 interrupted iterations
default   [  57% ] 059/100 VUs  1m41.7s/3m00.0s

running (1m43.0s), 060/100 VUs, 9172 complete and 0 interrupted iterations
default   [  57% ] 060/100 VUs  1m42.7s/3m00.0s

running (1m44.0s), 061/100 VUs, 9304 complete and 0 interrupted iterations
default   [  58% ] 061/100 VUs  1m43.7s/3m00.0s

running (1m45.0s), 062/100 VUs, 9451 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  1m44.7s/3m00.0s

running (1m46.0s), 063/100 VUs, 9596 complete and 0 interrupted iterations
default   [  59% ] 063/100 VUs  1m45.7s/3m00.0s

running (1m47.0s), 063/100 VUs, 9746 complete and 0 interrupted iterations
default   [  59% ] 063/100 VUs  1m46.7s/3m00.0s

running (1m48.0s), 064/100 VUs, 9896 complete and 0 interrupted iterations
default   [  60% ] 064/100 VUs  1m47.7s/3m00.0s

running (1m49.0s), 065/100 VUs, 10072 complete and 0 interrupted iterations
default   [  60% ] 065/100 VUs  1m48.7s/3m00.0s

running (1m50.0s), 066/100 VUs, 10210 complete and 0 interrupted iterations
default   [  61% ] 066/100 VUs  1m49.7s/3m00.0s

running (1m51.0s), 067/100 VUs, 10375 complete and 0 interrupted iterations
default   [  62% ] 067/100 VUs  1m50.7s/3m00.0s

running (1m52.0s), 068/100 VUs, 10529 complete and 0 interrupted iterations
default   [  62% ] 068/100 VUs  1m51.7s/3m00.0s

running (1m53.0s), 068/100 VUs, 10701 complete and 0 interrupted iterations
default   [  63% ] 068/100 VUs  1m52.7s/3m00.0s

running (1m54.0s), 069/100 VUs, 10856 complete and 0 interrupted iterations
default   [  63% ] 069/100 VUs  1m53.7s/3m00.0s

running (1m55.0s), 070/100 VUs, 11001 complete and 0 interrupted iterations
default   [  64% ] 070/100 VUs  1m54.7s/3m00.0s

running (1m56.0s), 071/100 VUs, 11143 complete and 0 interrupted iterations
default   [  64% ] 071/100 VUs  1m55.7s/3m00.0s

running (1m57.0s), 072/100 VUs, 11264 complete and 0 interrupted iterations
default   [  65% ] 072/100 VUs  1m56.7s/3m00.0s

running (1m58.0s), 073/100 VUs, 11402 complete and 0 interrupted iterations
default   [  65% ] 073/100 VUs  1m57.7s/3m00.0s

running (1m59.0s), 073/100 VUs, 11568 complete and 0 interrupted iterations
default   [  66% ] 073/100 VUs  1m58.7s/3m00.0s

running (2m00.0s), 074/100 VUs, 11698 complete and 0 interrupted iterations
default   [  67% ] 074/100 VUs  1m59.7s/3m00.0s

running (2m01.0s), 075/100 VUs, 11886 complete and 0 interrupted iterations
default   [  67% ] 075/100 VUs  2m00.7s/3m00.0s

running (2m02.0s), 076/100 VUs, 12051 complete and 0 interrupted iterations
default   [  68% ] 076/100 VUs  2m01.7s/3m00.0s

running (2m03.0s), 077/100 VUs, 12221 complete and 0 interrupted iterations
default   [  68% ] 077/100 VUs  2m02.7s/3m00.0s

running (2m04.0s), 078/100 VUs, 12398 complete and 0 interrupted iterations
default   [  69% ] 078/100 VUs  2m03.7s/3m00.0s

running (2m05.0s), 078/100 VUs, 12615 complete and 0 interrupted iterations
default   [  69% ] 078/100 VUs  2m04.7s/3m00.0s

running (2m06.0s), 079/100 VUs, 12785 complete and 0 interrupted iterations
default   [  70% ] 079/100 VUs  2m05.7s/3m00.0s

running (2m07.0s), 080/100 VUs, 12919 complete and 0 interrupted iterations
default   [  70% ] 080/100 VUs  2m06.7s/3m00.0s

running (2m08.0s), 081/100 VUs, 13061 complete and 0 interrupted iterations
default   [  71% ] 081/100 VUs  2m07.7s/3m00.0s

running (2m09.0s), 082/100 VUs, 13212 complete and 0 interrupted iterations
default   [  72% ] 082/100 VUs  2m08.7s/3m00.0s

running (2m10.0s), 083/100 VUs, 13325 complete and 0 interrupted iterations
default   [  72% ] 083/100 VUs  2m09.7s/3m00.0s

running (2m11.0s), 083/100 VUs, 13500 complete and 0 interrupted iterations
default   [  73% ] 083/100 VUs  2m10.7s/3m00.0s

running (2m12.0s), 084/100 VUs, 13688 complete and 0 interrupted iterations
default   [  73% ] 084/100 VUs  2m11.7s/3m00.0s

running (2m13.0s), 085/100 VUs, 13826 complete and 0 interrupted iterations
default   [  74% ] 085/100 VUs  2m12.7s/3m00.0s

running (2m14.0s), 086/100 VUs, 13984 complete and 0 interrupted iterations
default   [  74% ] 086/100 VUs  2m13.7s/3m00.0s

running (2m15.0s), 087/100 VUs, 14143 complete and 0 interrupted iterations
default   [  75% ] 087/100 VUs  2m14.7s/3m00.0s

running (2m16.0s), 088/100 VUs, 14319 complete and 0 interrupted iterations
default   [  75% ] 088/100 VUs  2m15.7s/3m00.0s

running (2m17.0s), 088/100 VUs, 14506 complete and 0 interrupted iterations
default   [  76% ] 088/100 VUs  2m16.7s/3m00.0s

running (2m18.0s), 089/100 VUs, 14700 complete and 0 interrupted iterations
default   [  77% ] 089/100 VUs  2m17.7s/3m00.0s

running (2m19.0s), 090/100 VUs, 14888 complete and 0 interrupted iterations
default   [  77% ] 090/100 VUs  2m18.7s/3m00.0s

running (2m20.0s), 091/100 VUs, 15006 complete and 0 interrupted iterations
default   [  78% ] 091/100 VUs  2m19.7s/3m00.0s

running (2m21.0s), 092/100 VUs, 15203 complete and 0 interrupted iterations
default   [  78% ] 092/100 VUs  2m20.7s/3m00.0s

running (2m22.0s), 093/100 VUs, 15366 complete and 0 interrupted iterations
default   [  79% ] 093/100 VUs  2m21.7s/3m00.0s

running (2m23.0s), 093/100 VUs, 15538 complete and 0 interrupted iterations
default   [  79% ] 093/100 VUs  2m22.7s/3m00.0s

running (2m24.0s), 094/100 VUs, 15681 complete and 0 interrupted iterations
default   [  80% ] 094/100 VUs  2m23.7s/3m00.0s

running (2m25.0s), 095/100 VUs, 15879 complete and 0 interrupted iterations
default   [  80% ] 095/100 VUs  2m24.7s/3m00.0s

running (2m26.0s), 096/100 VUs, 16059 complete and 0 interrupted iterations
default   [  81% ] 096/100 VUs  2m25.7s/3m00.0s

running (2m27.0s), 097/100 VUs, 16232 complete and 0 interrupted iterations
default   [  82% ] 097/100 VUs  2m26.7s/3m00.0s

running (2m28.0s), 098/100 VUs, 16406 complete and 0 interrupted iterations
default   [  82% ] 098/100 VUs  2m27.7s/3m00.0s

running (2m29.0s), 098/100 VUs, 16575 complete and 0 interrupted iterations
default   [  83% ] 098/100 VUs  2m28.7s/3m00.0s

running (2m30.0s), 099/100 VUs, 16692 complete and 0 interrupted iterations
default   [  83% ] 099/100 VUs  2m29.7s/3m00.0s

running (2m31.0s), 100/100 VUs, 16874 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  2m30.7s/3m00.0s

running (2m32.0s), 095/100 VUs, 17055 complete and 0 interrupted iterations
default   [  84% ] 095/100 VUs  2m31.7s/3m00.0s

running (2m33.0s), 093/100 VUs, 17253 complete and 0 interrupted iterations
default   [  85% ] 093/100 VUs  2m32.7s/3m00.0s

running (2m34.0s), 090/100 VUs, 17424 complete and 0 interrupted iterations
default   [  85% ] 090/100 VUs  2m33.7s/3m00.0s

running (2m35.0s), 086/100 VUs, 17593 complete and 0 interrupted iterations
default   [  86% ] 086/100 VUs  2m34.7s/3m00.0s

running (2m36.0s), 082/100 VUs, 17732 complete and 0 interrupted iterations
default   [  87% ] 082/100 VUs  2m35.7s/3m00.0s

running (2m37.0s), 079/100 VUs, 17881 complete and 0 interrupted iterations
default   [  87% ] 079/100 VUs  2m36.7s/3m00.0s

running (2m38.0s), 075/100 VUs, 18038 complete and 0 interrupted iterations
default   [  88% ] 075/100 VUs  2m37.7s/3m00.0s

running (2m39.0s), 072/100 VUs, 18234 complete and 0 interrupted iterations
default   [  88% ] 072/100 VUs  2m38.7s/3m00.0s

running (2m40.0s), 070/100 VUs, 18395 complete and 0 interrupted iterations
default   [  89% ] 070/100 VUs  2m39.7s/3m00.0s

running (2m41.0s), 065/100 VUs, 18573 complete and 0 interrupted iterations
default   [  89% ] 065/100 VUs  2m40.7s/3m00.0s

running (2m42.0s), 062/100 VUs, 18765 complete and 0 interrupted iterations
default   [  90% ] 062/100 VUs  2m41.7s/3m00.0s

running (2m43.0s), 058/100 VUs, 18927 complete and 0 interrupted iterations
default   [  90% ] 058/100 VUs  2m42.7s/3m00.0s

running (2m44.0s), 056/100 VUs, 19092 complete and 0 interrupted iterations
default   [  91% ] 056/100 VUs  2m43.7s/3m00.0s

running (2m45.0s), 052/100 VUs, 19235 complete and 0 interrupted iterations
default   [  92% ] 052/100 VUs  2m44.7s/3m00.0s

running (2m46.0s), 049/100 VUs, 19404 complete and 0 interrupted iterations
default   [  92% ] 049/100 VUs  2m45.7s/3m00.0s

running (2m47.0s), 045/100 VUs, 19606 complete and 0 interrupted iterations
default   [  93% ] 045/100 VUs  2m46.7s/3m00.0s

running (2m48.0s), 042/100 VUs, 19747 complete and 0 interrupted iterations
default   [  93% ] 042/100 VUs  2m47.7s/3m00.0s

running (2m49.0s), 038/100 VUs, 19917 complete and 0 interrupted iterations
default   [  94% ] 038/100 VUs  2m48.7s/3m00.0s

running (2m50.0s), 035/100 VUs, 20020 complete and 0 interrupted iterations
default   [  94% ] 035/100 VUs  2m49.7s/3m00.0s

running (2m51.0s), 032/100 VUs, 20178 complete and 0 interrupted iterations
default   [  95% ] 032/100 VUs  2m50.7s/3m00.0s

running (2m52.0s), 029/100 VUs, 20308 complete and 0 interrupted iterations
default   [  95% ] 029/100 VUs  2m51.7s/3m00.0s

running (2m53.0s), 025/100 VUs, 20429 complete and 0 interrupted iterations
default   [  96% ] 025/100 VUs  2m52.7s/3m00.0s

running (2m54.0s), 022/100 VUs, 20546 complete and 0 interrupted iterations
default   [  97% ] 022/100 VUs  2m53.7s/3m00.0s

running (2m55.0s), 019/100 VUs, 20641 complete and 0 interrupted iterations
default   [  97% ] 019/100 VUs  2m54.7s/3m00.0s

running (2m56.0s), 015/100 VUs, 20730 complete and 0 interrupted iterations
default   [  98% ] 015/100 VUs  2m55.7s/3m00.0s

running (2m57.0s), 012/100 VUs, 20802 complete and 0 interrupted iterations
default   [  98% ] 012/100 VUs  2m56.7s/3m00.0s

running (2m58.0s), 008/100 VUs, 20864 complete and 0 interrupted iterations
default   [  99% ] 008/100 VUs  2m57.7s/3m00.0s

running (2m59.0s), 005/100 VUs, 20910 complete and 0 interrupted iterations
default   [  99% ] 005/100 VUs  2m58.7s/3m00.0s

running (3m00.0s), 002/100 VUs, 20931 complete and 0 interrupted iterations
default   [ 100% ] 002/100 VUs  2m59.7s/3m00.0s


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    screen_latency
    ✓ 'p(95)<5000' p(95)=717.1ms


  █ TOTAL RESULTS 

    checks_total.......: 41870   232.158094/s
    checks_succeeded...: 100.00% 41870 out of 41870
    checks_failed......: 0.00%   0 out of 41870

    ✓ status is 200
    ✓ decision is PASS|FLAG|REJECT

    CUSTOM
    errors.........................: 0.00%  0 out of 20935
    screen_latency.................: avg=277.05ms min=33.57ms  med=202.12ms p(90)=589.79ms p(95)=717.1ms  p(99)=994.44ms max=2.19s

    HTTP
    http_req_duration..............: avg=277.04ms min=33.57ms  med=202.12ms p(90)=589.78ms p(95)=717.09ms p(99)=994.43ms max=2.19s
      { expected_response:true }...: avg=277.04ms min=33.57ms  med=202.12ms p(90)=589.78ms p(95)=717.09ms p(99)=994.43ms max=2.19s
    http_req_failed................: 0.00%  0 out of 20936
    http_reqs......................: 20936  116.084592/s

    EXECUTION
    iteration_duration.............: avg=378.57ms min=134.01ms med=303.35ms p(90)=691.26ms p(95)=818.63ms p(99)=1.09s    max=2.29s
    iterations.....................: 20935  116.079047/s
    vus............................: 2      min=1          max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 6.3 MB 35 kB/s
    data_sent......................: 6.2 MB 34 kB/s



running (3m00.4s), 000/100 VUs, 20935 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  3m0s